import React from 'react';
// react icon
import { MdPrint } from "react-icons/md";
// component
import TextChanger from '../../../shared/TextChanger';

const Advertisement = () => {

    const advertisements = [
        {
            id: 1,
            date: '2023-05-09',
            name: 'ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাক্রমের পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 2,
            date: '2023-05-09',
            name: 'ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাক্রমের পরীক্ষা-২০২২ এর সময়সূচি'
        },
        {
            id: 3,
            date: '2023-05-08',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের সরকারি-বেসরকারি প্রতিষ্ঠানসমূহের পুনঃভর্তির অনুমতি প্রসঙ্গে'
        },
        {
            id: 4,
            date: '2023-05-07',
            name: 'ডিপ্লোমা ইন টেক্সটাইল, এগ্রিকালচার, ফিসারিজ, লাইভষ্টক এবং ফরেস্ট্রি শিক্ষাক্রমের অনলাইনে শিক্ষকদের নামের তালিকা প্রেরণ'
        },
        {
            id: 5,
            date: '2023-05-07',
            name: 'ডিপ্লোমা ইন টেক্সটাইল, এগ্রিকালচার, ফিসারিজ, লাইভষ্টক এবং ফরেস্ট্রি শিক্ষাবর্ষ পরীক্ষা ২০২২ এর পুন:বিজ্ঞপ্তি '
        },
        {
            id: 6,
            date: '2023-05-02',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং (নেভাল স্পেশাল) পরীক্ষার বিজ্ঞপ্তি ও সময়সূচি'
        },
        {
            id: 7,
            date: '2023-04-27',
            name: 'ডিপ্লোমা ইন টেক্সটাইল শিক্ষাক্রমের পরীক্ষা ২০২২ এর পুন:বিজ্ঞপ্তি'
        },
        {
            id: 8,
            date: '2023-04-27',
            name: 'ডিপ্লোমা এগ্রিকালচার, ফিসারিজ, লাইভষ্টক ও ফরেস্ট্রি শিক্ষাক্রমের পরীক্ষা ২০২২ এর পুন:বিজ্ঞপ্তি'
        },
        {
            id: 9,
            date: '2023-04-26',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমে অধ্যয়নরত ৩য় পর্বের শিক্ষার্থীদের বদলির লক্ষ্যে শুন্য আসনের তালিকা প্রেরণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 10,
            date: '2023-04-25',
            name: 'ডিপ্লোমা ইন মেডিকেল টেকনোলজি শিক্ষাক্রমে বিভিন্ন পর্বে পুনঃভর্তির বিজ্ঞপ্তি'
        },
        {
            id: 11,
            date: '2023-04-18',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমে শিক্ষার্থীদের পুনঃভর্তির অনুমতি প্রদান'
        },
        {
            id: 12,
            date: '2023-04-18',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমে শিক্ষার্থীদের বদলীতে ভর্তির অনুমোদন প্রদান'
        },
        {
            id: 13,
            date: '2023-04-16',
            name: 'ডিপ্লোমা ইন মেডিকেল টেকনোলজি শিক্ষাক্রমে বিভিন্ন পর্বে পুনঃভর্তির বিজ্ঞপ্তি'
        },
        {
            id: 14,
            date: '2023-04-16',
            name: 'ডিপ্লোমা ইন মেডিকেল শিক্ষাক্রমের ফরম ফিলাপের সময়বৃদ্ধি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 15,
            date: '2023-04-13',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার,ফিসারিজ ও লাইভস্টক শিক্ষাক্রমে শিক্ষার্থী বদলীর আদেশ'
        },
        {
            id: 16,
            date: '2023-04-13',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের শিক্ষার্থীদের পুনঃভর্তির অনুমতি প্রদান'
        },
        {
            id: 17,
            date: '2023-04-13',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং (নেভাল) শিক্ষাক্রমের পরীক্ষার সংশোধিত সময়সূচি'
        },
        {
            id: 18,
            date: '2023-04-12',
            name: 'ডিপ্লোমা ইন মেডিকেল টেকনোলজি শিক্ষাক্রমে বিভিন্ন পর্বে পুনঃভর্তির বিজ্ঞপ্তি'
        },
        {
            id: 19,
            date: '2023-04-11',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের TC, PC, PF ও GPA নম্বর অন লাইনে প্রেরণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 20,
            date: '2023-04-11',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 21,
            date: '2023-04-11',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 22,
            date: '2023-04-09',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের ২য় পর্ব পরীপূরক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 23,
            date: '2023-04-09',
            name: 'ডিপ্লোমা ইন মেডিকেল এবং ডিপ্লোমা ইন ইঞ্জিনিয়ারিং নেভাল শিক্ষাক্রম পরীক্ষার প্রধান পরীক্ষক, পরীক্ষক ও নিরীক্ষকগণের পারিশ্রমিক বিল ব্যাংকে প্রেরণ'
        },
        {
            id: 24,
            date: '2023-04-06',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের মধ্য পরীক্ষা গ্রহণের বিজ্ঞপ্তি'
        },
        {
            id: 25,
            date: '2023-04-06',
            name: 'ডিপ্লোমা-ইন- টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের পর্ব-পরিকল্পনা প্রকাশের সংশোধনী বিজ্ঞপ্তি'
        },
        {
            id: 26,
            date: '2023-04-06',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং (নেভাল) পরীক্ষার সময়সূচি'
        },
        {
            id: 27,
            date: '2023-04-06',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং (নেভাল) পরীক্ষার ফরম ফিলাপের বিজ্ঞপ্তি'
        },
        {
            id: 28,
            date: '2023-04-06',
            name: 'ডিপ্লোমা ইন মেডিকেল টেকনোলজি শিক্ষাক্রমের ফরম ফিলাপের  বিজ্ঞপ্তি'
        },
        {
            id: 29,
            date: '2023-04-05',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং, ডিপ্লোমা ইন এগ্রিকালচার/ফিসারিজ/লাইভস্টক/ফরেস্ট্রি ফলাফল পুনঃনিরীক্ষণের বিজ্ঞপ্তি'
        },
        {
            id: 30,
            date: '2023-04-02',
            name: 'বেসরকারি ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং/টেক্সটাইল/এগ্রিকালচার শিক্ষাক্রমে পাঠদান নবায়ন'
        },
        {
            id: 31,
            date: '2023-03-21',
            name: 'ডিপ্লোমা পর্যায়ের শিক্ষাক্রমে ৩য় পর্বের বদলি ইচ্ছুক শিক্ষার্থীদের বদলি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 32,
            date: '2023-03-19',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের ২য় পর্ব পরিপূরক পরীক্ষার সময়সূচি'
        },
        {
            id: 33,
            date: '2023-03-19',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের ২য় পর্ব পরিপূরক পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 34,
            date: '2023-03-15',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং মেক-আপ কোর্সে নিবন্ধন সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 35,
            date: '2023-03-15',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং ও ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের ১ম, ৩য়, ৫ম ও ৭ম পর্বে অধ্যয়নরত পূনঃভর্তি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 36,
            date: '2023-03-09',
            name: 'ডিপ্লোমা ইন মেডিকেল টেকনোলজি পরীূক্ষার ফলাফল প্রকাশ ও উত্তরপত্র পুনঃনিরীক্ষণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 37,
            date: '2023-02-28',
            name: 'ডিপ্লোমা-ইন-ফিসারিজ (ইন সার্ভিস) শিক্ষাক্রমের পরীক্ষা ২০২২ এর বিজ্ঞপ্তি '
        },
        {
            id: 38,
            date: '2023-02-28',
            name: 'ডিপ্লোমা-ইন-ফিসারিজ (ইন সার্ভিস) শিক্ষাক্রমের পরীক্ষা ২০২২ এর সময়সূচি '
        },
        {
            id: 39,
            date: '2023-02-28',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার শিক্ষাক্রমের ২য় পর্ব পরিপূরক পরীক্ষা ২০২২ এর সময়সূচি'
        },
        {
            id: 40,
            date: '2023-02-28',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার ‍শিক্ষাক্রমের ২য় পর্ব পরিপূরক পরীক্ষা ২০২২ এর বিজ্ঞপ্তি'
        },
        {
            id: 41,
            date: '2023-02-28',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং পরীক্ষার উত্তরপত্র বিতরণ/গ্রহণ প্রসঙ্গে'
        },
        {
            id: 42,
            date: '2023-02-28',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং শিক্ষাক্রমের ব্যবহারিক পরীক্ষায় অনাভ্যন্তরীণ পরীক্ষক (External) নিয়োগ ( একই স্মারক ও তারিখের বিকল্প প্রতিলিপি ) প্রসঙ্গে'
        },
        {
            id: 43,
            date: '2023-02-08',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের মেশিন শপ প্র্যাকটিস-১ বিষয়ের সময়সূচি  সংশোধন সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 44,
            date: '2023-02-07',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের ৩য় পর্বের সিলেবাস প্রকাশ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 45,
            date: '2023-02-05',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং (নেভাল) ও (নেভাল স্পেশাল) উইন্টার ২০২৩ সেশন (২৩-০১) রেজিস্ট্রেশন কার্যক্রম গ্রহণের বিজ্ঞপ্তি'
        },
        {
            id: 46,
            date: '2023-02-01',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের পরীক্ষার সময়সুচির পরির্বতন সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 47,
            date: '2023-01-30',
            name: 'ডিপ্লোমা ইন মেডিকেল টেকনোলজি পরীক্ষার উত্তরপত্র গ্রহন প্রসঙ্গে'
        },
        {
            id: 48,
            date: '2023-01-26',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের (নেভাল) পরীক্ষার সময়সূচি'
        },
        {
            id: 49,
            date: '2023-01-26',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের (নেভাল) পরীক্ষার বিজ্ঞপ্তি '
        },
        {
            id: 50,
            date: '2023-01-26',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের কন্টোলরুম সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 51,
            date: '2023-01-23',
            name: 'দর্পণ পলিটেকনিক ইনস্টিটিউট (প্রতিষ্ঠান কোডঃ ২৭০৭৪) এর টেকনোলজি বন্ধকরণ প্রসঙ্গে'
        },
        {
            id: 52,
            date: '2023-01-19',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং শিক্ষাক্রমের ২য়, ৪র্থ, ৬ষ্ঠ ও ৮ম পর্ব পরীক্ষা-২০২২ এর সময়সূচি (সংশোধিত)'
        },
        {
            id: 53,
            date: '2023-01-19',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং এবং ডিপ্লোমা-ইন-ট্যুরিজম এন্ড হসপিটালিটি পরীক্ষার প্রবেশপত্র অনলাইনে প্রতিষ্ঠান কর্তৃক প্রিন্ট করা সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 54,
            date: '2023-01-19',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং পরীক্ষা ২০২২ এর অনাভ্যন্তরীণ পরীক্ষকদের তালিকা '
        },
        {
            id: 55,
            date: '2023-01-19',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং পরীক্ষা ২০২২ এর ব্যবহারিক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 56,
            date: '2023-01-17',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের অনাভ্যন্তরিণ পরীক্ষকদের তালিকা'
        },
        {
            id: 57,
            date: '2023-01-17',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের বোর্ড সমাপনী পরীক্ষা ২০২২ এর ব্যবহারিক পরীক্ষা কেন্দ্র তালিকা'
        },
        {
            id: 58,
            date: '2023-01-15',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং এবং ডিপ্লোমা-ইন-ট্যুরিজম এন্ড হসপিটালিটি পরীক্ষার প্রবেশপত্র অনলাইনে প্রতিষ্ঠান কর্তৃক প্রিন্ট করা সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 59,
            date: '2023-01-12',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং শিক্ষাক্রমের পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 60,
            date: '2023-01-09',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং এর ১০ তারিখ বিকালের ৫ম পর্বের পরীক্ষার পরিবর্তিত সময়সূচি'
        },
        {
            id: 61,
            date: '2023-01-08',
            name: '২০২৩ সালের জানুয়ারি মাসে  অনুষ্ঠিত ডিপ্লোমা ইন মেডিকেল টেকনোলজি ব্যবহারিক পরীক্ষার কেন্দ্র তালিকা সংক্রান্ত'
        },
        {
            id: 62,
            date: '2023-01-02',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের তাত্ত্বিক পরীক্ষার আকস্মিক পরিদর্শনের অফিস আদেশ'
        },
        {
            id: 63,
            date: '2023-01-02',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের তাত্ত্বিক পরীক্ষার আকস্মিক পরিদর্শনের অফিস আদেশ'
        },
        {
            id: 64,
            date: '2022-12-28',
            name: 'ডিপ্লোমা ইন মেডিকেল টেকনোলজি শিক্ষাক্রমের কন্টোলরুম সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 65,
            date: '2022-12-28',
            name: 'বেসরকারি ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং/টেক্সটাইল/এগ্রিকালচার শিক্ষাক্রমে পাঠদান নবায়ন'
        },
        {
            id: 66,
            date: '2022-12-28',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং/এগ্রিকালচার/ফিসারিজ/লাইভস্টক পরীক্ষার প্রতিদিনের তথ্য বোর্ডে প্রেরণ'
        },
        {
            id: 67,
            date: '2022-12-22',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং পরীক্ষার ফরম ফিলাপের সময় বৃদ্ধি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 68,
            date: '2022-12-21',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং নেভাল (স্পেশাল) শিক্ষাক্রমের পরীক্ষা ২০২৩ এর সময়সূচি'
        },
        {
            id: 69,
            date: '2022-12-21',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং নেভাল (স্পেশাল) শিক্ষাক্রমের পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 70,
            date: '2022-12-21',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের পরীক্ষার সময়সুচি-২০২২'
        },
        {
            id: 71,
            date: '2022-12-21',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের পরীক্ষার সময়সূচি-২০২২'
        },
        {
            id: 72,
            date: '2022-12-18',
            name: 'সাইক ইনস্টিটিউট অব ম্যানেজমেন্ট এন্ড টেকনোলজি, মিরপুর, ঢাকা এর টেকনোলজি বন্ধকরণ প্রসঙ্গে'
        },
        {
            id: 73,
            date: '2022-12-18',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের তাত্ত্বিক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 74,
            date: '2022-12-18',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের তাত্ত্বিক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 75,
            date: '2022-12-15',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের বেসরকারি ইন্সটিটিউটসমূহের বদলীর অনুমোদন সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 76,
            date: '2022-12-14',
            name: '৩য় পর্ব পরিপূরক পরীক্ষার GPA এন্ট্রি করার সময় বৃদ্ধি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 77,
            date: '2022-12-14',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং শিক্ষাক্রম এবং ট্যুরিজম এন্ড হসপিটালিটি শিক্ষাক্রমের পরীক্ষা সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 78,
            date: '2022-12-14',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের বদলীর অনুমোদন সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 79,
            date: '2022-12-14',
            name: 'ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাক্রমের পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 80,
            date: '2022-12-14',
            name: 'ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাক্রমের পরীক্ষার সময়সূচি'
        },
        {
            id: 81,
            date: '2022-12-12',
            name: 'ডিপ্লোমা ইন টেকনিক্যাল এডুকেশন শিক্ষাক্রমের পরীক্ষার সময়সূচি'
        },
        {
            id: 82,
            date: '2022-12-12',
            name: 'ডিপ্লোমা ইন টেকনিক্যাল এডুকেশন শিক্ষাক্রমের পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 83,
            date: '2022-12-11',
            name: 'ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাক্রমের ফরমফিলাপের সময়বৃদ্ধি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 84,
            date: '2022-12-11',
            name: 'ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাক্রমের পুনঃভর্তির অনুমোদনের বিজ্ঞপ্তি'
        },
        {
            id: 85,
            date: '2022-12-11',
            name: 'ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাক্রমের বদলীর অনুমোদনের বিজ্ঞপ্তি'
        },
        {
            id: 86,
            date: '2022-12-08',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের কম্পিউটার টেকনোলজির ৬ষ্ঠ পর্বের বিষয় নির্বাচন সম্পর্কিত বিজ্ঞপ্তি'
        },
        {
            id: 87,
            date: '2022-12-05',
            name: 'আগস্ট-সেপ্টেম্বর, ২০২২ মাসে অনুষ্ঠিত ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং ডিপ্লোমা-ইন-ট্যুরিজম এন্ড হসপিটালিটি এবং সার্টিফিকেট-ইন-মেরিন ট্রেড শিক্ষাক্রমের ফলাফল প্রকাশ ও পুনঃ নিরীক্ষণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 88,
            date: '2022-12-05',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং এবং ট্যুরিজম শিক্ষাক্রমের সংযোগ রক্ষাকারী ফি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 89,
            date: '2022-12-04',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের সরকারি-বেসরকারি প্রতিষ্ঠানসমূহের পুনঃভর্তির অনুমোদন'
        },
        {
            id: 90,
            date: '2022-12-01',
            name: 'ডিপ্লোমা ইন মেডিকেল টেকনোলজি শিক্ষাক্রমের পরীক্ষার ফরম ফিলাপের বিজ্ঞপ্তি'
        },
        {
            id: 91,
            date: '2022-12-01',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের সরকারি পলিটেকনিক প্রতিষ্ঠানসমূহের বদলিকৃত শিক্ষার্থীদের তালিকা'
        },
        {
            id: 92,
            date: '2022-11-26',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের ২য়, ৪র্থ, ৬ষ্ঠ ও ৮ম পর্বের পরীক্ষার ফরমফিলাপের বিজ্ঞপ্তি'
        },
        {
            id: 93,
            date: '2022-11-26',
            name: 'ডিপ্লোমা এন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের ২য়, ৪র্থ, ৬ষ্ঠ ও ৮ম পর্বের পরীক্ষার ফরমফিলাপের বিজ্ঞপ্তি'
        },
        {
            id: 94,
            date: '2022-11-24',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের প্রতিষ্ঠানভিত্তিক শুন্য আসনের তথ্য প্রেরণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 95,
            date: '2022-11-24',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং এবং ট্যুরিজম শিক্ষাক্রমের এফিলিয়েশন ফি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 96,
            date: '2022-11-22',
            name: 'বেসরকারি ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং/টেক্সটাইল/এগ্রিকালচার শিক্ষাক্রমে পাঠদান নবায়ন'
        },
        {
            id: 97,
            date: '2022-11-21',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের শিক্ষার্থী বদলিতে ভর্তির অনুমতি প্রসঙ্গে'
        },
        {
            id: 98,
            date: '2022-11-20',
            name: 'ডিপ্লোমা ইন মেডিকেল পরীক্ষার ফলাফল প্রকাশ ও উত্তরপত্র পুনঃনিরীক্ষণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 99,
            date: '2022-11-20',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমে যাচাই-বাছাইকৃত ১৪৭ জন শিক্ষার্থীর পুনঃভর্তির অনুমতি প্রসঙ্গে'
        },
        {
            id: 100,
            date: '2022-11-20',
            name: 'ই-সেবায় ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং এবং ডিপ্লোমা-ইন-ট্যুরিজম এন্ড হসপিটালিটি শিক্ষাক্রমের শিক্ষক তথ্য হালনাগাদকরণের বিজ্ঞপ্তি'
        },
        {
            id: 101,
            date: '2022-11-17',
            name: 'বেসরকারি ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং/টেক্সটাইল শিক্ষাক্রমে পাঠদান নবায়ন - ১৭.১১.২০২২'
        },
        {
            id: 102,
            date: '2022-11-07',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং (নেভাল) শিক্ষাক্রমের পরীক্ষা ২০২২ এর সময়সূচি'
        },
        {
            id: 103,
            date: '2022-11-06',
            name: 'বেসরকারি ডিপ্লোমা ইন ইঞ্জিনিয়ারিং/টেক্সটাইল/এগ্রিকালচার/ফিসারিজ শিক্ষাক্রমে পাঠদান নবায়ন'
        },
        {
            id: 104,
            date: '2022-11-03',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের সরকারি-বেসরকারি পলিটেকনিক প্রতিষ্ঠানসমূহের বদলিকৃত শিক্ষার্থীদের তালিকা'
        },
        {
            id: 105,
            date: '2022-11-03',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের বেসরকারি পলিটেকনিক প্রতিষ্ঠানসমূহের বদলিকৃত শিক্ষার্থীদের তালিকা'
        },
        {
            id: 106,
            date: '2022-11-01',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং ৩য় পর্ব পরিপূরক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 107,
            date: '2022-11-01',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং ৩য় পর্ব পরিপূরক পরীক্ষার সময়সূচি'
        },
        {
            id: 108,
            date: '2022-10-26',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং (নেভাল) পরীক্ষার ফরম ফিলাপের বিজ্ঞপ্তি'
        },
        {
            id: 109,
            date: '2022-10-24',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের ৪র্থ পর্বের শূণ্য আসনে এইচএসসি (ভোকেশনাল) অপেক্ষমান তালিকা থেকে শিক্ষার্থী ভর্তির ফলাফল ও ভর্তির নিয়মাবলি'
        },
        {
            id: 110,
            date: '2022-10-13',
            name: 'ডিপ্লোমা ইন টেক্সটাইল, এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের ৩য় পর্ব পরিপূরক পরীক্ষার সময়সূচি'
        },
        {
            id: 111,
            date: '2022-10-13',
            name: 'ডিপ্লোমা ইন টেক্সটাইল শিক্ষাক্রমের ৩য় পর্ব পরিপূরক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 112,
            date: '2022-10-13',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের ৩য় পর্ব পরিপূরক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 113,
            date: '2022-10-13',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং, টেক্সটাইল ইঞ্জিনিয়ারিং, এগ্রিকালচার, ফরেস্ট্রি, লাইভস্টক, মেরিন ইন্সটিটিউট ও ট্যুরিজম শিক্ষাক্রমের বদলি সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 114,
            date: '2022-10-11',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং ৩য় পর্ব পরিপূরক পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 115,
            date: '2022-10-11',
            name: 'বেসরকারি ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং/টেক্সটাইল/এগ্রিকালচার/ফিসারিজ শিক্ষাক্রমে পাঠদান নবায়ন - ১১.১০.২০২২'
        },
        {
            id: 116,
            date: '2022-10-10',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং ও ডিপ্লোমা ইন ট্যুরিজম এন্ড হসপিটালিটি শিক্ষাক্রমের প্রধান পরীক্ষক নিয়োগাদেশ'
        },
        {
            id: 117,
            date: '2022-10-04',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং/টেক্সটাইল/এগ্রিকালচার/ফিসারিজ/লাইভস্টক/ফরেস্ট্রি শিক্ষাক্রমের শিক্ষার্থীদের শিল্প-কারখানায় বাস্তব প্রশিক্ষণ/মাঠ সংযুক্তি প্রশিক্ষণের ক্ষেত্রে কোন নির্দিষ্ট প্রতিষ্ঠানে জোরপূর্বক বাধ্য না করণ প্রসঙ্গে'
        },
        {
            id: 118,
            date: '2022-10-03',
            name: 'ডিপ্লোমা ইন টেক্সটাইল শিক্ষাক্রমের ৩য় পর্ব পরিপূরক পরীক্ষার ফরম পূরণের বিজ্ঞপ্তি'
        },
        {
            id: 119,
            date: '2022-10-03',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের ৩য় পর্ব পরিপূরক পরীক্ষার ফরম পূরণের বিজ্ঞপ্তি'
        },
        {
            id: 120,
            date: '2022-10-02',
            name: 'ডিপ্লোমা ইন টেক্সটাইল, এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের TC & PC নম্বর প্রেরণের পুনঃবিজ্ঞপ্তি'
        },
        {
            id: 121,
            date: '2022-09-18',
            name: '৪র্থ পর্বে ভর্তি এবং ৪ র্থ পর্বের শিক্ষার্থীদের বদলির লক্ষ্যে শুন্য আসনের তালিকা প্রেরণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 122,
            date: '2022-09-18',
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং/টেক্সটাইল শিক্ষাক্রমের পূনঃভর্তির তথ্য প্রেরণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 123,
            date: '2022-09-13',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং পরীক্ষার উত্তরপত্র মূল্যায়নের জন্য বিতরণ বিজ্ঞপ্তি'
        },
        {
            id: 124,
            date: '2022-09-11',
            name: 'ডিপ্লোমা-ইন-টেক্সটাইল/এগ্রিকালচার/ফিসারিজ/লাইভস্টক/ফরেস্ট্রি শিক্ষাক্রমের PF এবং GPA নম্বর প্রেরণের সময় বৃদ্ধির বিজ্ঞপ্তি'
        },
        {
            id: 125,
            date: '2022-08-29',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি অনাভ্যন্তরিন পরীক্ষকদের তালিকা'
        },
        {
            id: 126,
            date: '2022-08-29',
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি ব্যবহারিক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 127,
            date: '2022-08-29',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের অনাভ্যন্তরিন পরীক্ষকদের তালিকা'
        },
        {
            id: 128,
            date: '2022-08-29',
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের ব্যবহারিক পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 129,
            date: '2022-08-23',
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং/টেক্সটাইল/এগ্রিকালচার/ফিসারিজ/লাইভস্টক/ফরেস্ট্রি শিক্ষাক্রমের শিক্ষার্থীদের শিল্প-কারখানায় বাস্তব প্রশিক্ষণ/মাঠ সংযুক্তি প্রশিক্ষণের তথ্য প্রেরণ প্রসঙ্গে'
        },
        {
            id: 130,
            date: '2022-08-22',
            name: 'বেসরকারি ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং/টেক্সটাইল/এগ্রিকালচার/ফিসারিজ শিক্ষাক্রমে পাঠদান নবায়ন'
        },
        {
            id: 131,
            date: '2022-08-21',
            name: 'ডিপ্লোমা ইঞ্জিনিয়ারিং পরীক্ষার কন্ট্রোলরুম খোলা সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 132,
            date: '2022-08-18',
            name: 'ডিপ্লোমা ইন মেডিকেল পরীক্ষার পরিবর্তিত কেন্দ্র তালিকা'
        }
    ]

    return (
        <div className="container 2xl:px-10 pt-10 mx-auto bg-white">
            <TextChanger />
            <MdPrint className='text-3xl mt-7' />
            <p className='text-sm text-right'>সর্ব-শেষ হাল-নাগাদ: ৯ মে ২০২৩</p>
            <hr />
            <h1 className='text-3xl py-5'>সকল ডিপ্লোমা নোটিশ</h1>
            <div className='pb-5'>
                {
                    advertisements.map(advertisement =>
                        <div key={advertisement.id} className='flex'>
                            <div className='w-1/12 border py-3 flex justify-center text-base text-gray-500'>
                                <p>{advertisement.date}</p>
                            </div>
                            <div className='w-11/12 border py-3 pl-2'>
                                <p className='text-base text-gray-500 hover:text-black hover:cursor-pointer'>{advertisement.name}</p>
                            </div>
                        </div>
                    )
                }
            </div>
        </div>
    );
};

export default Advertisement;