import React from 'react';
// react icon
import { MdPrint } from "react-icons/md";
// component
import TextChanger from '../../../shared/TextChanger';

const ShortTerm = () => {

    const shorts = [
        {
            id: 1,
            date: '2023-05-11',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের প্রতিষ্ঠান পরিদর্শনের অফিস আদেশ-১০.০৫.২০২৩'
        },
        {
            id: 2,
            date: '2023-05-10',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের এপ্রিল-জুন ২০২৩ সেশনের রেজিস্ট্রেশন কার্যক্রম গ্রহণের বিজ্ঞপ্তি'
        },
        {
            id: 3,
            date: '2023-05-10',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের জানুয়ারি-জুন ও এপ্রিল-জুন ২০২৩ সেশনের পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 4,
            date: '2023-05-10',
            name: 'সার্টিফিকেট ইন মেডিকেল আল্ট্রাসাউন্ড (CMU) শিক্ষাক্রমের জানুয়ারি-জুন সেশনের পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 5,
            date: '2023-04-18',
            name: '১ বছর মেয়াদি এ্যানিমেল হেলথ প্রতিষ্ঠান পরিদর্শন সংক্রান্ত অফিস আদেশ'
        },
        {
            id: 6,
            date: '2023-04-17',
            name: '২০২২ সালে ৩৬০ ঘন্টার কোর্স সম্পন্নকারী সংক্রান্ত তথ্য প্রেরণ'
        },
        {
            id: 7,
            date: '2023-04-17',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের জানুয়ারি-জুন ২০২৩ সেশনের রেজিস্ট্রেশন ফি প্রদানের সময় বৃদ্ধি'
        },
        {
            id: 8,
            date: '2023-04-16',
            name: 'পোল্ট্রি ফার্মিং ও এনিমেল হেলথ অ্যান্ড প্রডাকশন শিক্ষাক্রমের জুলাই-জুন (২০২১-২২) ২য় পর্ব বোর্ড সমাপনী পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 9,
            date: '2023-04-16',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের প্রতিষ্ঠান পরিদর্শনের অফিস আদেশ'
        },
        {
            id: 10,
            date: '2023-04-11',
            name: 'এক বছর মেয়াদি অ্যাডভান্সড সার্টিফিকেট কোর্স পরিদর্শন সংক্রান্ত অফিস আদেশ'
        },
        {
            id: 11,
            date: '2023-04-05',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের প্রতিষ্ঠান পাঠদান সংক্রান্ত অফিস আদেশ'
        },
        {
            id: 12,
            date: '2023-04-02',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্ট) শিক্ষাক্রমের জানুয়ারি-মার্চ ২০২৩ সেশনের পরীক্ষার কেন্দ্র পুনঃবিজ্ঞপ্তি'
        },
        {
            id: 13,
            date: '2023-03-28',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের জানুয়ারি-মার্চ ২০২৩ সেশনের রেজিস্ট্রেশন কার্ড বিতরণের বিজ্ঞপ্তি'
        },
        {
            id: 14,
            date: '2023-03-28',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের জানুয়ারি-মার্চ পরীক্ষার রেজিস্ট্রেশন ফি প্রদানের বিজ্ঞপ্তি'
        },
        {
            id: 15,
            date: '2023-03-27',
            name: 'এডভান্সড সার্টিফিকেট কোর্স শিক্ষাক্রমের প্রতিষ্ঠান পরিদর্শনের অফিস আদেশ'
        },
        {
            id: 16,
            date: '2023-03-27',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের প্রতিষ্ঠান পরিদর্শনের অফিস আদেশ'
        },
        {
            id: 17,
            date: '2023-03-22',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর, ২০২৩ সেশনের রেজিস্ট্রেশনের পুনঃবিজ্ঞপ্তি (৩য় বার)'
        },
        {
            id: 18,
            date: '2023-03-22',
            name: 'সার্টিফিকেট ইন মেডিকেল আল্ট্রাসাউন্ড (CMU) জানুয়ারি-জুন, ২০২৩ রেজিস্ট্রেশনের বিজ্ঞপ্তি'
        },
        {
            id: 19,
            date: '2023-03-21',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের জানুয়ারি-জুন ২০২৩ সেশনের রেজিস্ট্রেশন কার্যক্রম সম্পন্ন করার পুনঃবিজ্ঞপ্তি (৩য় বার)'
        },
        {
            id: 20,
            date: '2023-03-19',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের পরীক্ষার উত্তরপত্র পরীক্ষক, নিরীক্ষক ও প্রধান পরীক্ষকের জন্য অন-লাইনে ফরম পূরণ বিজ্ঞপ্তি'
        },
        {
            id: 21,
            date: '2023-03-14',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের জুলাই-ডিসেম্বর, জুলাই-সেপ্টেম্বর ও অক্টোবর-ডিসেম্বর, ২০২২ সেশনের পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 22,
            date: '2023-03-14',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জানুয়ারি-ডিসেম্বর ২০২২ সেশনের ২য় পর্ব বোর্ড সমাপনী ও ১ম পর্ব পরিপূরক পরীক্ষার সময়সূচি'
        },
        {
            id: 23,
            date: '2023-03-14',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জানুয়ারি-ডিসেম্বর ২০২২ সেশনের ২য় পর্ব বোর্ড সমাপনী ও ১ম পর্ব পরিপূরক পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 24,
            date: '2023-03-14',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের রেজিস্ট্রেশন কার্যক্রম গ্রহণের পুনঃবিজ্ঞপ্তি'
        },
        {
            id: 25,
            date: '2023-03-14',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জানুয়ারি-জুন ২০২৩ সেশনে রেজিস্ট্রেশন কার্যক্রম গ্রহণের পুনঃবিজ্ঞপ্তি'
        },
        {
            id: 26,
            date: '2023-03-06',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জানুয়ারি-মার্চ  ও জানুয়ারি-জুন ২০২৩ সেশনের শিক্ষাথীদের রেজিস্ট্রেশন কার্যক্রম গ্রহণের বিজ্ঞপ্তি'
        },
        {
            id: 27,
            date: '2023-03-06',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জানুয়ারি-ডিসেম্বর ২০২৩ সেশনের শিক্ষার্থীদের রেজিস্ট্রেশন কার্যক্রম গ্রহণের '
        },
        {
            id: 28,
            date: '2023-03-06',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জানুয়ারি-ডিসেম্বর ২০২৩ সেশনের ২য় পর্ব বোর্ড সমাপনী ও ১ম পর্ব পরিপূরক পরীক্ষার ফরম পূরণের সংশোধনী বিজ্ঞপ্তি'
        },
        {
            id: 29,
            date: '2023-03-04',
            name: 'সার্টিফিকেট ইন এ্যানিমেল হেলথ প্রতিষ্ঠান পাঠদানের অনুমোদন সংক্রান্ত অফিস আদেশ-২০২৩ একই স্মারক ও তারিখের বিকল্প প্রতিলিপি'
        },
        {
            id: 30,
            date: '2023-03-04',
            name: 'জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদি প্রতিষ্ঠান পাঠদান পরিদর্শন সংক্রান্ত অফিস আদেশ-২৩'
        },
        {
            id: 31,
            date: '2023-03-04',
            name: '১ বছর মেয়াদি এ্যানিমেল হেলথের পাঠদান পরিদর্শন সংক্রান্ত অফিস আদেশ-২০২৩'
        },
        {
            id: 32,
            date: '2023-03-04',
            name: '১ বছর মেয়াদি অ্যাডভান্স সার্টিফিকেট কোর্স পাঠদান পরিদর্শন সংক্রান্ত অফিস আদেশ'
        },
        {
            id: 33,
            date: '2023-03-04',
            name: '১ বছর মেয়াদি অ্যাডভান্স সার্টিফিকেট কোর্সের পাঠদানের অনুমতি সংক্রান্ত একই স্মারক ও তারিখের বিকল্প প্রতিলিপি'
        },
        {
            id: 34,
            date: '2023-03-01',
            name: 'জাতীয় দক্ষতামান বেসিক ও অ্যাডভান্স সার্টিফিকেট কোর্স পরীক্ষার উত্তরপত্র পরীক্ষক, নিরীক্ষক ও প্রধান পরীক্ষকগণের পারিশ্রমিক বিল ব্যাংকে প্রেরণ'
        },
        {
            id: 35,
            date: '2023-02-28',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জানুয়ারি-মার্চ ২০২৩ সেশনের লিখিত ও ব্যবহারিক পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 36,
            date: '2023-02-28',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জুলাই-জুন সেশনের ২য় পর্ব বোর্ড সমাপনী পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 37,
            date: '2023-02-23',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জানুয়ারি-ডিসেম্বর ২০২২ সেশনের ২য় পর্ব পরীক্ষার ফরম পূরণের বিজ্ঞপ্তি'
        },
        {
            id: 38,
            date: '2023-02-20',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স শিক্ষাক্রম সরেজমিনে পরিদর্শন করার জন্য অফিস আদেশ'
        },
        {
            id: 39,
            date: '2023-02-19',
            name: 'সার্টিফিকেট ইন মেডিকেল টেকনোলজি শিক্ষাক্রমের ২য় পর্ব বোর্ড সমাপনি পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 40,
            date: '2023-02-19',
            name: 'সার্টিফিকেট ইন মেডিকেল আল্ট্রাসাউন্ড (CMU) শিক্ষাক্রমের জুলাই-ডিসেম্বর সেশনের পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 41,
            date: '2023-02-15',
            name: 'সার্টিফিকেট ইন এ্যানিমেল হেলথ প্রতিষ্ঠান পাঠদানের অনুমোদন সংক্রান্ত অফিস আদেশ-২০২৩'
        },
        {
            id: 42,
            date: '2023-02-14',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা মেয়াদি) পাঠদানের অনুমোদন সংক্রান্ত অফিস আদেশ-২০২৩'
        },
        {
            id: 43,
            date: '2023-02-13',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা মেয়াদি) প্রতিষ্ঠানের নাম পরিবর্তনের অনুমতি প্রদান সংক্রান্ত'
        },
        {
            id: 44,
            date: '2023-02-13',
            name: '১ বছর মেয়াদি অ্যাডভান্স সার্টিফিকেট কোর্স প্রতিষ্ঠান পাঠদানের অনুমতি প্রদান সংক্রান্ত অফিস আদেশ'
        },
        {
            id: 45,
            date: '2023-02-13',
            name: '১ বছর মেয়াদি অ্যাডভান্স ও জাতীয় দক্ষতামান বেসিক যেসকল প্রতিষ্ঠান সুপারিশপ্রাপ্ত হয়নি সেসকল প্রতিষ্ঠানের তালিকা-২০২৩'
        },
        {
            id: 46,
            date: '2023-02-13',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা মেয়াদি) প্রতিষ্ঠানের ট্রেড বৃদ্ধি ও আসন সংযোজন  এবং স্থান পরিবর্তনের অনুমতি প্রদান সংক্রান্ত'
        },
        {
            id: 47,
            date: '2023-01-31',
            name: 'জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদি পাঠদান সংক্রান্ত অনুমোদনপ্রাপ্ত প্রতিষ্ঠানের তালিকা-২০২৩'
        },
        {
            id: 48,
            date: '2023-01-29',
            name: '১ বছর মেয়াদি অ্যাডভান্স সার্টিফিকেট কোর্স ও জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদি সেকল প্রতিষ্ঠান অনুমোদনপ্রাপ্ত হয়নি সেসকল প্রতিষ্ঠানসমূহের তালিকা'
        },
        {
            id: 49,
            date: '2023-01-23',
            name: 'জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদি যেসকল প্রতিষ্ঠান পাঠদানের অনুমোদনপ্রাপ্ত হয়নি সেসকল প্রতিষ্ঠানের তালিকাসমূহ'
        },
        {
            id: 50,
            date: '2023-01-23',
            name: 'প্রত্যাশা কম্পিউটার প্রশিক্ষণ ইন্সটিটিউট, চাঁদপুর প্রতিষ্ঠানটির ট্রেডসমূহ বাতিলের অফিস আদেশ'
        },
        {
            id: 51,
            date: '2023-01-19',
            name: '১ বছর মেয়াদি অ্যাডভান্সড সার্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর,২০২২ সেশনের ১ম পর্ব পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 52,
            date: '2022-01-10',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) পরীক্ষার্থীদের অনলাইনে TC, PC নম্বর প্রেরণের সময় বৃদ্ধি এবং PF নম্বর প্রেরণের বিজ্ঞপ্তি '
        },
        {
            id: 53,
            date: '2022-01-10',
            name: 'অ্যাডভান্স সার্টিফিকেট কোর্স ও সার্টিফিকেট ইন এ্যানিমেল হেলথ এবং জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্ট মেয়াদি যেসকল প্রতিষ্ঠান অনুমোদিত নয় সেসকল প্রতিষ্ঠানের তালিকাসমূহ'
        },
        {
            id: 54,
            date: '2022-01-10',
            name: 'পোল্ট্রি ফার্মিং ও এনিমেল হেলথ অ্যান্ড প্রডাকশন শিক্ষাক্রমের জুলাই-জুন (২০২২-২৩ ও ২০২১-২২) ১ম ও ২য় পর্ব পরীক্ষার সময়সূচি'
        },
        {
            id: 55,
            date: '2022-01-10',
            name: 'পোল্ট্রি ফার্মিং ও এনিমেল হেলথ অ্যান্ড প্রডাকশন শিক্ষাক্রমের জুলাই-জুন (২০২২-২৩ ও ২০২১-২২) ১ম ও ২য় পর্ব পরীক্ষার কেন্দ্র তালিকা'
        },
        {
            id: 56,
            date: '2022-12-29',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জুলাই-ডিসেম্বর, জুলাই-সেপ্টেম্বর  ও অক্টো-ডিসেম্বর সেশনের TC PC নম্বর প্রেরণের বিজ্ঞপ্তি'
        },
        {
            id: 57,
            date: '2022-12-28',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জুলাই-ডিসেম্বর, জুলাই-সেপ্টেম্বর  ও অক্টো-ডিসেম্বর পরীক্ষার উত্তরপত্র পরীক্ষক, নিরীক্ষক ও প্রধান পরীক্ষকের অনলাইন ফরম পূরণ বিজ্ঞপ্তি'
        },
        {
            id: 58,
            date: '2022-12-26',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের চূড়ান্ত পরীক্ষার (জুলাই-ডিসেম্বর, জুলাই-সেপ্টেম্বর ও অক্টোবর-ডিসেম্বর, ২০২২ সেশন) কেন্দ্র তালিকা'
        },
        {
            id: 59,
            date: '2022-12-22',
            name: 'জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদি শিক্ষাক্রমের প্রতিষ্ঠানের তথ্য হালনাগাদকরণ'
        },
        {
            id: 60,
            date: '2022-12-21',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জুলাই-ডিসেম্বর, জুলাই-সেপ্টেম্বর ও অক্টোবর-ডিসেম্বর সেশনের রেজিস্ট্রেশন কার্ড বিতরণের বিজ্ঞপ্তি'
        },
        {
            id: 61,
            date: '2022-12-21',
            name: 'সার্টিফিকেট ইন মেরিন ট্রেড শিক্ষাক্রমের পরীক্ষা-২০২২ এর সময়সূচি'
        },
        {
            id: 62,
            date: '2022-12-21',
            name: 'সার্টিফিকেট ইন মেরিন ট্রেড শিক্ষাক্রমের পরীক্ষা-২০২২ এর ফরম ফিলাপের বিজ্ঞপ্তি'
        },
        {
            id: 63,
            date: '2022-12-14',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের পরীক্ষার দায়িত্ব পালন প্রসঙ্গে'
        },
        {
            id: 64,
            date: '2022-12-11',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জুলাই-ডিসেম্বর ও জুলাই-সেপ্টেম্বর সেশনের রেজিস্ট্রেশন ফি গ্রহণের পুনঃবিজ্ঞপ্তি (৩য় বার)'
        },
        {
            id: 65,
            date: '2022-12-11',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জুলাই-জুন সেশনের ২য় পর্ব বোর্ড সমাপনী পরীক্ষার সময়সূচি'
        },
        {
            id: 66,
            date: '2022-12-11',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জুলাই-জুন সেশনের ২য় পর্ব বোর্ড সমাপনী পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 67,
            date: '2022-12-08',
            name: 'সার্টিফিকেট ইন পোল্ট্রি ফার্মিং ও এনিমেল হেলথ শিক্ষাক্রমের জুলাই-জুন সেশনের পরীক্ষার অনলাইন ফরম পূরণ বিজ্ঞপ্তি'
        },
        {
            id: 68,
            date: '2022-12-01',
            name: 'সার্টিফিকেট ইন মেডিকেল আল্ট্রাসাউন্ড (CMU) শিক্ষাক্রমের জুলাই-ডিসেম্বর পরীক্ষার সময়সূচি '
        },
        {
            id: 69,
            date: '2022-12-01',
            name: 'সার্টিফিকেট ইন মেডিকেল আল্ট্রাসাউন্ড (CMU) শিক্ষাক্রমের জুলাই-ডিসেম্বর পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 70,
            date: '2022-11-29',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের পুনঃভর্তির অনুমতি প্রসঙ্গে-২৮.১১.২০২২'
        },
        {
            id: 71,
            date: '2022-11-29',
            name: 'জানুয়ারি ২০২৩ সেশনে জাতীয় দক্ষতামান বেসিক ও অ্যাডভান্সড সার্টিফিকেট কোর্স শিক্ষাক্রমে ভর্তি বিজ্ঞপ্তি'
        },
        {
            id: 72,
            date: '2022-11-28',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জুলাই-ডিসেম্বর, জুলাই-সেপ্টেম্বর ও অক্টোবর-ডিসেম্বর, ২০২২ সেশনের পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 73,
            date: '2022-11-28',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের জুলাই-জুন সেশনের বোর্ড সমাপনী পরীক্ষার উত্তরপত্র পরীক্ষক, নিরীক্ষক ও প্রধান পরীক্ষকের ফরম পূরণ বিজ্ঞপ্তি'
        },
        {
            id: 74,
            date: '2022-11-27',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের অক্টোবর-ডিসেম্বর ২০২২ সেশনের শিক্ষাথীদের রেজিস্ট্রেশন কার্যক্রম গ্রহণের বিজ্ঞপ্তি'
        },
        {
            id: 75,
            date: '2022-11-24',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স  শিক্ষাক্রমের পুনঃভর্তির অনুমতি প্রসঙ্গে'
        },
        {
            id: 76,
            date: '2022-11-22',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জুলাই-সেপ্টেম্বর ও জুলাই-ডিসেম্বর রেজিস্ট্রেশন ফি প্রদানের বিজ্ঞপ্তি'
        },
        {
            id: 77,
            date: '2022-11-22',
            name: '০১ বছর মেয়াদি সার্টিফিকেট ইন মেডিকেল টেকনোলজি ২য় পর্ব (অনিয়মিত) সমাপনি পরীক্ষার সময়সূচি'
        },
        {
            id: 78,
            date: '2022-11-22',
            name: '০১ বছর মেয়াদি সার্টিফিকেট ইন মেডিকেল টেকনোলজি ২য় পর্ব (অনিয়মিত) সমাপনি পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 79,
            date: '2022-11-17',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্স শিক্ষাক্রমে ২৪ (চব্বিশ) জন শিক্ষার্থীকে পুনঃভর্তির অনুমতি প্রসঙ্গে'
        },
        {
            id: 80,
            date: '2022-11-17',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্স জুলাই-জুন, ২০২১-২২ সেশনের ১ম পর্ব সমাপনী পরীক্ষায় শিক্ষার্থীদের প্রাপ্ত GPA Online -এ এন্ট্রি প্রসঙ্গে'
        },
        {
            id: 81,
            date: '2022-11-10',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্স জুলাই-জুন, ২০২১-২২ সেশনের ২য় পর্ব সমাপনী পরীক্ষার ফরম পূরণের বিজ্ঞপ্তি'
        },
        {
            id: 82,
            date: '2022-11-10',
            name: 'সার্টিফিকেট ইন মেডিকেল আল্ট্রাসাউন্ড (CMU) জুলাই-জুন, ২০২২ সেশনের চূড়ান্ত পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 83,
            date: '2022-11-06',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর ২০২২ সেশনের পরীক্ষার সময়সূচি'
        },
        {
            id: 84,
            date: '2022-11-06',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর ২০২২ সেশনের পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 85,
            date: '2022-11-02',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর ২০২২ সেশনের পরীক্ষার পরীক্ষকের জন্য অন-লাইনে ফরম পূরণ বিজ্ঞপ্তি'
        },
        {
            id: 86,
            date: '2022-10-30',
            name: 'জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদী শিক্ষাক্রমের পরিদর্শন সংক্রান্ত অফিস আদেশ-২৭.১০.২০২২'
        },
        {
            id: 87,
            date: '2022-10-30',
            name: 'এক বছর মেয়াদি এনিমেল হেলথ শিক্ষাকমের প্রতিষ্ঠান পরিদর্শন সংক্রান্ত অফিস আদেশ-২৭.১০.২০২২'
        },
        {
            id: 88,
            date: '2022-10-26',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর ২০২২ সেশনের TC PC নম্বর প্রেরণের পুনঃবিজ্ঞপ্তি'
        },
        {
            id: 89,
            date: '2022-10-25',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জুলাই-ডিসেম্বর সেশনের রেজিস্ট্রেশন কার্যক্রম গ্রহণের পুনঃবিজ্ঞপ্তি'
        },
        {
            id: 90,
            date: '2022-10-25',
            name: 'সার্টিফিকেট ইন পোল্ট্রি ফার্মিং ও এনিমেল হেলথ শিক্ষাক্রমের রেজিস্ট্রেশন কার্যক্রম গ্রহণের বিজ্ঞপ্তি'
        },
        {
            id: 91,
            date: '2022-10-20',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর ২০২২ সেশনের রেজিস্ট্রেশন কার্ড বিতরণের বিজ্ঞপ্তি'
        },
        {
            id: 92,
            date: '2022-10-20',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স শিক্ষাক্রমে জানুয়ারি-ডিসেম্বর ২০২১ সেশনের পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 93,
            date: '2022-10-20',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জানুয়ারি-জুন, জানুয়ারি-মার্চ ও এপ্রিল-জুন সেশনের পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 94,
            date: '2022-10-20',
            name: 'সার্টিফিকেট ইন মেডিকেল আল্ট্রাসাউন্ড (CMU) শিক্ষাক্রমের জানুয়ারি-জুন সেশনের পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 95,
            date: '2022-10-20',
            name: 'সার্টিফিকেট ইন পোল্ট্রি ফার্মিং ও এনিমেল হেলথ শিক্ষাক্রমের জুলাই-জুন সেশনের পরীক্ষার উত্তরপত্র পুনঃনিরীক্ষণ বিজ্ঞপ্তি'
        },
        {
            id: 96,
            date: '2022-10-13',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জুলাই-সেপ্টেম্বর ও জুলাই-ডিসেম্বর রেজিস্ট্রেশন কার্যক্রম গ্রহণের পুনঃবিজ্ঞপ্তি'
        },
        {
            id: 97,
            date: '2022-10-13',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর ২০২২ সেশনের ১ম পর্ব সমাপনী পরীক্ষার ফরম পূরণের বিজ্ঞপ্তি '
        },
        {
            id: 98,
            date: '2022-10-12',
            name: 'অ্যাডভান্সড সর্টিফিকেট কোর্স শিক্ষাক্রমে জানুয়ারি-ডিসেম্বর ২০২২ সেশনের পর্ব সমাপনী পরীক্ষা অনুষ্ঠান প্রসঙ্গে'
        },
        {
            id: 99,
            date: '2022-09-25',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্স (১ বছর মেয়াদি) শিক্ষাক্রমে ভর্তি প্রসঙ্গে'
        },
        {
            id: 100,
            date: '2022-09-22',
            name: 'এসএসসি-দাখিল (ভোক) শিক্ষাক্রমের রেজিস্ট্রেশনের সময়সীমা বর্ধিত করে পুনঃবিজ্ঞপ্তি'
        },
        {
            id: 101,
            date: '2022-09-20',
            name: 'জাতীয় দক্ষতামান বেসিক জুলাই-সেপ্টেম্বর ও জুলাই-ডিসেম্বর শিক্ষাক্রমের রেজিস্ট্রেশন কার্যক্রম গ্রহণের বিজ্ঞপ্তি'
        },
        {
            id: 102,
            date: '2022-09-06',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জেলা ভিত্তিক মহিলা প্রকল্প -৬৪ জেলা স্থান পরিবর্তন-২০২২'
        },
        {
            id: 103,
            date: '2022-09-06',
            name: 'জাতীয় দক্ষতামান বেসিক ভর্তি বিজ্ঞপ্তি-(অক্টোবর-ডিসেম্বর-২০২২)'
        },
        {
            id: 104,
            date: '2022-08-29',
            name: 'জাতীয় দক্ষতামান বেসিক প্রতিষ্ঠান পরিদর্শন সংক্রান্ত অফিস আদেশ-২০২২'
        },
        {
            id: 105,
            date: '2022-08-29',
            name: 'এক বছর মেয়াদি এনিমেল হেলথ শিক্ষাক্রমের প্রতিষ্ঠন পরিদর্শন সংক্রান্ত অফিস আদেশ-২০২২'
        },
        {
            id: 106,
            date: '2022-08-29',
            name: 'জাতীয় দক্ষতামান বেসিক ট্রেড বাতিল সংক্রান্ত অফিস আদেশ-২০২২'
        },
        {
            id: 107,
            date: '2022-08-25',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের প্রতিষ্ঠানের তথ্য হালনাগাদকরণ'
        },
        {
            id: 108,
            date: '2022-08-10',
            name: 'জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদি পাঠদান সংক্রান্ত অফিস আদেশ ২০২২'
        },
        {
            id: 109,
            date: '2022-08-04',
            name: 'সার্টিফিকেট-ইন-মেরিন ট্রেড ১ম ও ৩য় পর্ব পরীক্ষার সময়সূচি'
        },
        {
            id: 110,
            date: '2022-08-04',
            name: 'জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদির ট্রেড বাতিল সংক্রান্ত অফিস আদেশ ২০২২'
        },
        {
            id: 111,
            date: '2022-08-03',
            name: 'জাতীয় দক্ষতামান বেসিক ৩৬০ ঘন্টা মেয়াদি পাঠদান আসন ও ট্রেড বৃদ্ধি সংক্রান্ত অফিস আদেশ ২০২২'
        },
        {
            id: 112,
            date: '2022-07-28',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের জানুয়ারি-জুন, জানুয়ারি-মার্চ ও এপ্রিল-জুন,২০২২ পরীক্ষার TF & PF নম্বর প্রেরণ সংক্রান্ত বিজ্ঞপ্তি'
        },
        {
            id: 113,
            date: '2022-07-27',
            name: 'জাতীয় দক্ষতামান বেসিক জানুয়ারি-জুন, জানুয়ারি-মার্চ ও এপ্রিল-জুন, ২০২২ পরীক্ষার উত্তরপত্র পরীক্ষক, নিরীক্ষক ও প্রধান পরীক্ষকের জন্য অন-লাইনে ফরম পূরণ বিজ্ঞপ্তি'
        },
        {
            id: 114,
            date: '2022-07-27',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা মেয়াদি) পাঠদান ও ট্রেড সংযোজন সংক্রান্ত অফিস আদেশ'
        },
        {
            id: 115,
            date: '2022-07-25',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্স জানুয়ারি-ডিসেম্বর পরীক্ষার উত্তরপত্র পরীক্ষক, নিরীক্ষক ও প্রধান পরীক্ষকের জন্য অন-লাইনে ফরম পূরণ বিজ্ঞপ্তি'
        },
        {
            id: 116,
            date: '2022-07-18',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের জানুয়ারি-জুন, জানুয়ারি-মার্চ ও এপ্রিল-জুন,২০২২ লিখিত ও ব্যবহারিক পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 117,
            date: '2022-07-17',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্সের জুলাই-জুন, ২০২১-২২ সেশনের ১ম পর্ব সমাপনী পরীক্ষার সময়সূচী'
        },
        {
            id: 118,
            date: '2022-07-17',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্সের জুলাই-জুন, ২০২১-২২ সেশনের ১ম পর্ব সমাপনী পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 119,
            date: '2022-07-17',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্সের জানুয়ারি-ডিসেম্বর, ২০২১ সেশনের ২য় পর্ব সমাপনী পরীক্ষার সময়সূচী'
        },
        {
            id: 120,
            date: '2022-07-17',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্সের জানুয়ারি-ডিসেম্বর, ২০২১ সেশনের ২য় পর্ব সমাপনী পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 121,
            date: '2022-07-07',
            name: 'জাতীয় দক্ষতামান বেসিক শিক্ষাক্রমের (জানুয়ারি-মার্চ, জানুয়ারি-জুন ও এপ্রিল-জুন-২০২২) রেজিস্ট্রেশন কার্ড বিতরণের বিজ্ঞপ্তি'
        },
        {
            id: 122,
            date: '2022-06-27',
            name: 'পোল্ট্রি ফার্মিং ও এনিমেল হেলথ অ্যান্ড প্রডাকশন ২য় পর্ব সমাপনী পরীক্ষার কেন্দ্র ও সময় সূচি'
        },
        {
            id: 123,
            date: '2022-06-27',
            name: 'পোল্ট্রি ফার্মিং ও এনিমেল হেলথ অ্যান্ড প্রডাকশন ১ম পর্ব সমাপনী পরীক্ষার কেন্দ্র ও সময় সূচি'
        },
        {
            id: 124,
            date: '2022-06-26',
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্স জুলাই-জুন ১ম পর্ব ও জানুয়ারি-ডিসেম্বর ২য় পর্ব পরীক্ষার ফরম পূরণের সময় বর্ধিতকরণ'
        },
        {
            id: 125,
            date: '2022-06-21',
            name: 'জাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের জানুয়ারি-জুন, জানুয়ারি-মার্চ ও এপ্রিল-জুন,২০২২ লিখিত ও ব্যবহারিক পরীক্ষার বিজ্ঞপ্তি'
        },
        {
            id: 126,
            date: '2022-06-20',
            name: 'সার্টিফিকেট ইন মেডিকেল আলট্রাসাউন্ড শিক্ষাক্রমের জানুয়ারি-জুন ২০২২ সেশনের পরীক্ষার সময়সূচি'
        },
        {
            id: 127,
            date: '2022-06-20',
            name: 'সার্টিফিকেট ইন মেডিকেল আল্ট্রাসাউন্ড শিক্ষাক্রমের জানুয়ারি-জুন, ২০২২ সেশনের পরীক্ষার কেন্দ্র বিজ্ঞপ্তি'
        },
        {
            id: 128,
            date: '2022-06-14',
            name: 'জাতীয় দক্ষতামান বেসিক (জুলাই-ডিসেম্বর ও অক্টোবর-ডিসেম্বর)'
        }
    ]

    return (
        <div className="container 2xl:px-10 pt-10 mx-auto bg-white">
            <TextChanger />
            <MdPrint className='text-3xl mt-7' />
            <p className='text-sm text-right'>সর্ব-শেষ হাল-নাগাদ: ১১ মে ২০২৩</p>
            <hr />
            <h1 className='text-3xl py-5'>সল্পমেয়াদী ও অন্যান্য নোটিশ</h1>
            <div className='pb-5'>
                {
                    shorts.map(short =>
                        <div key={short.id} className='flex'>
                            <div className='w-1/12 border py-3 flex justify-center text-base text-gray-500'>
                                <p>{short.date}</p>
                            </div>
                            <div className='w-11/12 border py-3 pl-2'>
                                <p className='text-base text-gray-500 hover:text-black hover:cursor-pointer'>{short.name}</p>
                            </div>
                        </div>
                    )
                }
            </div>
        </div>
    );
};

export default ShortTerm;