import React from 'react';

const OrganizationCommittees = () => {

    const organizations = [
        {
            id: 1,
            name: 'এসএসসি (ভোকেশনাল) ও এইচএসসি (বিএমটি) এর এডহক কমিটি অনুমতির আবেদন যাচাইকরণ ফরম'
        },
        {
            id: 2,
            name: 'এসএসসি (ভোকেশনাল) ও এইচএসসি (বিএমটি) এর এডহক কমিটি অনুমোদনের আবেদন যাচাইকরণ ফরম'
        },
        {
            id: 3,
            name: 'এসএসসি (ভোকেশনাল) ও এইচএসসি (বিএমটি) এর শিক্ষানুরাগী সদস্য অনুমোদনের আবেদন যাচাইকরণ ফরম'
        },
        {
            id: 4,
            name: 'এসএসসি (ভোকেশনাল), এইচএসসি (বিএমটি) ও বেসিক ট্রেড কোর্স (৩৬০ ঘন্টা) এর সংস্থার ব্যবস্থাপনা কমিটি অনুমোদনের আবেদন যাচাইকরণ ফরম'
        },
        {
            id: 5,
            name: 'এসএসসি (ভোকেশনাল) ও এইচএসসি (বিএমটি) এর সাংগঠনিক কমিটি অনুমোদনের আবেদন যাচাইকরণ ফরম'
        },
        {
            id: 6,
            name: 'এসএসসি (ভোকেশনাল), এইচএসসি (বিএমটি) ও বেসিক ট্রেড কোর্স (৩৬০ ঘন্টা) এর সাধারণ ব্যবস্থাপনা কমিটি অনুমোদনের আবেদন যাচাইকরণ ফরম'
        },
        {
            id: 7,
            name: 'এসএসসি (ভোকেশনাল), এইচএসসি (বিএমটি) ও বেসিক ট্রেড কোর্স (৩৬০ ঘন্টা) এর স্ব-অর্থায়নের ব্যবস্থাপনা কমিটি অনুমোদনের আবেদন যাচাইকরণ ফরম'
        },
        {
            id: 8,
            name: 'প্রতিনিধি আবেদনপত্র যাচাইকরণ ফরম (এসএসসি/দাখিল (ভোকেশনাল))'
        },
        {
            id: 9,
            name: 'প্রতিনিধি আবেদনপত্র যাচাইকরণ ফরম (বিএম)'
        }
    ]

    return (
        <div className='mt-10'>
            <h1 className='text-lg font-semibold'>প্রতিষ্ঠানের বিভিন্ন কমিটি সংক্রান্ত ফরম</h1>
            {
                organizations.map(organization =>
                    <div key={organization.id} className='border border-gray-300'>
                        <p className='text-base py-3 text-gray-500 hover:text-black hover:cursor-pointer pl-2'>{organization.name}</p>
                    </div>
                )
            }
        </div>
    );
};

export default OrganizationCommittees;