import React from 'react';

const FirstPart = () => {

    const firstPart = [
        {
            id: 1,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের পর্ব-পরিকল্পনা-২০২৩ (মার্চ থেকে জুলাই)'
        },
        {
            id: 2,
            name: 'ডিপ্লোমা ইন টেক্সটাইল শিক্ষাক্রমের শিক্ষা বষপঞ্জি-২০২৩'
        },
        {
            id: 3,
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ, লাইভস্টক ও ফরেস্ট্রি শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি-২০২৩'
        },
        {
            id: 4,
            name: 'পঞ্জিজাতীয় দক্ষতামান বেসিক (৩৬০ ঘন্টা) শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি-২০২৩'
        },
        {
            id: 5,
            name: 'অ্যাডভান্সড সার্টিফিকেট কোর্স (১বছর মেয়াদি) শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি-২০২৩'
        },
        {
            id: 6,
            name: 'জেএসসি (ভোকেশনাল), এসএসসি (ভোকেশনাল) ও দাখিল (ভোকেশনাল) শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি ২০২৩'
        },
        {
            id: 7,
            name: 'এইচ এসসি (বিএমটি/ভোকেশনাল) ও ডিপ্লোমা ইন কমার্স শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি ২০২৩'
        },
        {
            id: 8,
            name: '০৪ বছর মেয়াদি ডিপ্লোমা ইন মেডিকেল টেকনোলজি শিক্ষা বর্ষপঞ্জিঃ ২০২২-২০২৩'
        },
        {
            id: 9,
            name: 'ডিপ্লোমা ইন এগ্রিকালচার/লাইভস্টক/ফিসারিজ/ফরেস্ট্রি শিক্ষাক্রমের পর্ব-পরিকল্পনা (সেপ্টেম্বর, ২০২২ থেকে ফেব্রুয়ারি, ২০২৩)'
        },
        {
            id: 10,
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের পর্ব-পরিকল্পনা (সেপ্টেম্বর, ২০২২ থেকে ফেব্রুয়ারি, ২০২৩)'
        },
        {
            id: 11,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের পর্ব-পরিকল্পনা (অক্টোবর, ২০২২ থেকে মার্চ, ২০২৩)'
        },
        {
            id: 12,
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, লাইভস্টক, ফরেস্ট্রি, ফিসারিজ শিক্ষাক্রমের (মে, ২০২২ থেকে সেপ্টেম্বর, ২০২২)'
        },
        {
            id: 13,
            name: 'ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি (মে,২০২২ থেকে সেপ্টেম্বর,২০২২)'
        },
        {
            id: 14,
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি (মে,২০২২ থেকে সেপ্টেম্বর,২০২২)'
        },
        {
            id: 15,
            name: 'এইচএসসি (বিএমটি/ভোকেশনাল) ও ডিপ্লোমা-ইন-কমার্স শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি - ২০২২'
        },
        {
            id: 16,
            name: 'জেএসসি (ভোকেশনাল), এসএসসি (ভোকেশনাল) ও দাখিল (ভোকেশনাল) শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি ২০২২'
        },
        {
            id: 17,
            name: 'শর্ট কোর্স একাডেমিক ক্যালেন্ডার - ২০২২'
        },
        {
            id: 18,
            name: 'ডিপ্লোমা ইন এগ্রিকালচার/ফিসারিজ/লাইভস্টক/ফরেস্ট্রি শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জিঃ২০২১-২২ (ডিসেম্বর থেকে এপ্রিল)'
        },
        {
            id: 19,
            name: 'ডিপ্লোমা ইন এগ্রিকালচার/ফিসারিজ/লাইভস্টক/ফরেস্ট্রি শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জিঃ২০২১'
        },
        {
            id: 20,
            name: '৪ বছর মেয়াদি ডিপ্লোমা ইন মেডিকেল টেকনোলজি শিক্ষা বর্ষপঞ্জিঃ ২০২১-২০২২'
        },
        {
            id: 21,
            name: 'এইচএসসি (বিএম/ভোকেশনাল)/ডিপ্লোমা ইন কমার্স শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জিঃ ২০২১-২২ খ্রিঃ (সংশোধিত)'
        },
        {
            id: 22,
            name: 'এইচএসসি (বিএম/ভোকেশনাল)/ডিপ্লোমা ইন কমার্স শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি:২০২১-২২'
        },
        {
            id: 23,
            name: 'জেএসসি/এসএসসি/দাখিল (ভোকেশনাল) শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি ২০২১'
        },
        {
            id: 24,
            name: 'এসএসসি/দাখিল (ভোকেশনাল)  শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি: ২০২০'
        },
        {
            id: 25,
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ ও লাইভস্টক শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি ২০১৯-২০২০ (সংশোধিত)'
        },
        {
            id: 26,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি: ২০১৯-২০২০ (সংশোধিত)'
        },
        {
            id: 27,
            name: '৪ বছর মেয়াদি ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাবর্ষপঞ্জি ২০১৯-২০২০'
        },
        {
            id: 28,
            name: '১ বছর মেয়াদি সার্টিফিকেট কোর্সের শিক্ষাবর্ষ পঞ্জিঃ-২০১৯-২০২০'
        },
        {
            id: 29,
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের সংশোধিত শিক্ষা বর্ষপঞ্জি : ২০১৯-২০২০'
        },
        {
            id: 30,
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ ও লাইভস্টক শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি: ২০১৯-২০'
        },
        {
            id: 31,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি : ২০১৯-২০২০'
        },
        {
            id: 32,
            name: 'এইচএসসি (বিএম) ও ডিপ্লোমা ইন কমার্স শিক্ষক্রমের শিক্ষা বর্ষপঞ্জি : ২০১৯-২০২০'
        },
        {
            id: 33,
            name: 'এইচএসসি (ভোক) শিক্ষক্রমের শিক্ষা বর্ষপঞ্জি : ২০১৯-২০২০'
        }
    ]

    return (
        <div>
            {
                firstPart.map(first =>
                    <p key={first.id} className='text-base pt-1 text-gray-500 hover:text-black hover:cursor-pointer'>{first.name}</p>
                )
            }
        </div>
    );
};

export default FirstPart;