import React from 'react';

const SecondPart = () => {

    const secondPart = [
        {
            id: 1,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের সংশোধিত শিক্ষা বর্ষপঞ্জিঃ ২০১৮-১৯'
        },
        {
            id: 2,
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের সংশোধিত শিক্ষা বর্ষপঞ্জি ২০১৮-১৯'
        },
        {
            id: 3,
            name: 'ডিপ্লোমা-ইন-এগ্রিকালচার, ফিসারিজ ও লাইভস্টক শিক্ষাক্রমের সংশোধিত শিক্ষা বর্ষপঞ্জি ২০১৮-১৯'
        },
        {
            id: 4,
            name: 'এসএসসি/দাখিল (ভোক) শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি-২০১৯'
        },
        {
            id: 5,
            name: '১ বছর মেয়াদি সার্টিফিকেট কোর্সের শিক্ষাবর্ষ পঞ্জিঃ-২০১৮-১৯'
        },
        {
            id: 6,
            name: 'এইচএসসি (বিএম/ভোক) শিক্ষাক্রমের ২০১৮-১৯ শিক্ষাবর্ষের শিক্ষাবর্ষপঞ্জি'
        },
        {
            id: 7,
            name: 'ডিপ্লোমা-ইন-টেক্সটাইল ইঞ্জিনিয়ারিং শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি ২০১৮-১৯'
        },
        {
            id: 8,
            name: 'ডিপ্লোমা-ইন-এগ্রিকালচার, ফিসারিজ ও লাইভস্টক শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি ২০১৮-১৯'
        },
        {
            id: 9,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের সংশোধিত শিক্ষা বর্ষপঞ্জিঃ ২০১৮-১৯'
        }
    ]

    return (
        <div className='py-10'>
            {
                secondPart.map(second =>
                    <p key={second.id} className='text-base pt-1 text-gray-500 hover:text-black hover:cursor-pointer'>{second.name}</p>
                )
            }
        </div>
    );
};

export default SecondPart;