import React from 'react';

const ThirdPart = () => {

    const thirdPart = [
        {
            id: 1,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং (আর্মি) শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জিঃ ২০১৮'
        },
        {
            id: 2,
            name: 'এসএসসি/দাখিল (ভোক) শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি : ২০১৮'
        },
        {
            id: 3,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের সংশোধিত শিক্ষা বর্ষপঞ্জি : ২০১৭-২০১৮'
        },
        {
            id: 4,
            name: 'ডিপ্লোমা ইন এগ্রিকালচার, ফিসারিজ ও লাইভস্টক শিক্ষাক্রমের সংশোধিত শিক্ষা বর্ষপঞ্জি ২০১৭-১৮'
        },
        {
            id: 5,
            name: 'ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিংশিক্ষাক্রমের সংশোধিত শিক্ষা বর্ষপঞ্জি : ২০১৭-১৮'
        },
        {
            id: 6,
            name: '১ বছর মেয়াদি স্বাস্থ্য প্রযুক্তি ও সেবা শিক্ষাক্রম শিক্ষাবর্ষপঞ্জি ২০১৭-১৮'
        },
        {
            id: 7,
            name: '৪ বছর মেয়াদি ডিপ্লোমা ইন মেডিক্যাল টেকনোলজি শিক্ষাবর্ষপঞ্জি ২০১৭-১৮'
        },
        {
            id: 8,
            name: 'এইচএসসি (ভোক) শিক্ষাবর্ষপঞ্জি: ২০১৭-১৮'
        },
        {
            id: 9,
            name: 'এইচএসসি (বিএম) শিক্ষাবর্ষপঞ্জি: ২০১৭-১৮'
        },
        {
            id: 10,
            name: 'ডিপ্লোমা ইন ইঞ্জিনিয়ারিং শিক্ষাক্রমের শিক্ষা বর্ষপঞ্জি: ২০১৭-২০১৮'
        }
    ]

    return (
        <div>
            {
                thirdPart.map(third =>
                    <p key={third.id} className='text-base pt-1 text-gray-500 hover:text-black hover:cursor-pointer'>{third.name}</p>
                )
            }
        </div>
    );
};

export default ThirdPart;